using System.Collections.Immutable;

namespace LightsOn.BlazorApp.Views.Components.Service;

public sealed record ServiceMenu(
    ImmutableList<ServiceItem> ServiceItems);
public sealed record ServiceItem(string HeaderText, string MainText, int LowerPriceLimit);
public partial class Service
{
    public Service()
    {
        var serviceMenuItems = ImmutableList.Create(
            items: new[]
            {
                new ServiceItem("Підібрати дизель генератор",
                    "Визначення необхідної потужності ДГУ (дизельно-генераторна установка)\n" +
                                                              "Вибір ДГУ з врахувань побажань замовника\n" +
                                                              "Пропозиція по можливих варіантах ДГУ",
                    400),
                new ServiceItem("Їх встановлення",
                    "Виїзд на місце інсталяції ДГУ для попереднього огляду\n" +
                                                   "Надання рекомендацій та генерація попередньої пропозиції(кошторису)\n" +
                                                   "Підбір постачальників та узгодження з замовником вартості та термінів робіт\n" +
                                                   "Проведення монтажних та пуско-налагоджування робіт(протягнення дротів, запрограмувати генератор) на об'єкті\n" +
                                                   "Тестування обладнання та надання інформації замовником.",
                    750),
                new ServiceItem("Обслуговування енергетичного обладнання замовника",
                    "Аналіз енергетичного обладнання(авр, будь що до чого дроти підключені, щити, автомати) та документація об'єкта\n" +
                    "Надання рекомендацій по обслуговуванню та модифікації енергетичного обладнання\n" +
                    "Узгодження вартості і терміну робіт\n" +
                    "Проведення робіт\nФормування вихідної документації",
                    575),
                
                new ServiceItem("Його діагностика",
                    "Аналіз енергетичного обладнання(авр, будь що до чого дроти підключені, щити, автомати) та документація об'єкта\n" +
                    "Надання рекомендацій по обслуговуванню та модифікації енергетичного обладнання\n" +
                    "Формування вихідної документації.",
                    450),
            });

        ServiceMenu = new ServiceMenu(serviceMenuItems);
    }
    
    public ServiceMenu ServiceMenu { get; set; }
}